content/posts/birlescu2020.md
+++
title = "birlescu2020 | Joint-Space Characterization of a Medical Parallel Robot Based on a Dual Quaternion Representation of SE(3)"
author = ["João Gutemberg Farias"]
draft = false
+++

Muito grande. Não li. Só sei que usa os [parâmetros de Study]({{< relref "study_parameters" >}}) e aplica num [robô médico paralelo]({{< relref "parallel_mechanisms" >}})


## Info {#info}

The paper proposes a mathematical method for redefining motion parameterizations based on the joint-space representation of parallel robots. The study parameters of SE(3) are used to describe the robot kinematic chains, but, rather than directly analyzing the mobile platform motion, the joint-space of the mechanism is studied by eliminating the Study parameters. From the loop equations of the joint-space characterization, new parameterizations are defined, which enable the placement of a mobile frame on any mechanical element within the parallel robot. A case study is presented for a medical parallel robotic system in which the joint-space characterization is achieved and based on a new defined parameterization, the kinematics for displacement, velocities, and accelerations are studied. A numerical simulation is presented for the derived kinematic models, showing how the medical robot guides the medical tool (ultrasound probe) on an imposed trajectory.


## Notes {#notes}


### Resumo {#resumo}

Muito grande. Não li. Só sei que usa os [parâmetros de Study]({{< relref "study_parameters" >}}) e aplica num [robô médico paralelo]({{< relref "parallel_mechanisms" >}})
